/******************************************************************
                         USB.H  file

主要功能：接口定义、全局变量定义及函数申明

创建时间：2013.11.21
*******************************************************************/
#ifndef __USB_H__
#define __USB_H__
#define count 0x0F					//USB可以传送的字节数：16
/*--------------------------------------------------------------*/
/*-------------------------全局变量定义-------------------------*/
/*--------------------------------------------------------------*/
extern unsigned char InBuf[count];
extern unsigned char OutBuf[count];
extern bit           UsbOutFlag;

/*--------------------------------------------------------------*/
/*---------------------------函数声明---------------------------*/
/*--------------------------------------------------------------*/
void RecieveReport(void);
void SendReport(void);
void UsbInit(void);
void UsbDisconnect(void);
void UsbConnect(void);


#endif